#+begin_html
---
date: 2013-06-12
template: tech.jade
title: Mojolicious Web框架实现分析 -- App启动过程
category: Perl
change_frequency: monthly
---
#+end_html
#+OPTIONS: toc:nil
#+TOC: headlines 2
** 前言
   由于我对Web框架的理解不是很清晰，所以希望能借着阅读代码进行全面的了解，加之自己对Perl相对熟悉，所以就选择Perl的web框架来分析，Mojolicious特点是实时，基于事件，
比较拟合当前的趋势，加之其代码精简，也可以从中学习到Perl编程的一些经验和技巧.

由于Mojolicious.pm 是编写App时候继承的类，所以我们从这里开始，分析流程是从程序被启动到一个请求被处理完毕，只会分析HTTP协议.

假设我们编写了MyApp，目录结构如下:
#+BEGIN_SRC sh :eval no-export :results output raw :exports results
tree ~/tmp/my_app 
#+END_SRC

#+RESULTS:
#+BEGIN_EXAMPLE
/home/chinaxing/tmp/my_app
├── lib
│   ├── MyApp
│   │   └── Example.pm
│   └── MyApp.pm
├── log
├── public
│   └── index.html
├── script
│   └── my_app
├── t
│   └── basic.t
└── templates
    ├── example
    │   └── welcome.html.ep
    └── layouts
        └── default.html.ep
#+END_EXAMPLE


